#include "ioCC2530.h"
#include "init.h"
//****输出端口初始化
void init_port(){
  //初始化输出端口
  //初始化LED灯的I/O端口
  P1SEL &= ~0x1b;   //P1_0、P1_1、P1_3和P1_4作为通用I/O端口
  P1DIR |= 0x1b;    //P1_0、P1_1、P1_3和P1_4端口输出
  //关闭所有的LED灯
  P1 &= ~0x1b;
  P1SEL &= ~0x04;     //P1_2作为通用I/O端口
  P1DIR &= ~0x04;     //P1_2端口输入
  P1INP &= ~0x04;     //P1_2设置为上拉/下拉模式
  P2INP &= ~0x40;     //P1_2设置为上拉

  P0SEL &= ~0x02;     //P0_1作为通用I/O端口
  P0DIR &= ~0x02;     //P0_1端口输入
  P0INP &= ~0x02;     //P0_1设置为上拉/下拉模式
  P2INP &= ~0x20;     //P0_1设置为上拉
}
//****中断 sw_1 sw_2 初始化
void init_btn(int sta){ //设置上升沿还是下降沿  0是上升沿 1是下降沿
  //对SW1的中断使能
  IEN2 |= 0x10;     //使能P1端口组外部中断（IEN2不能位操作）0001 0000
  P1IEN |= 0x04;    //使能P1_2引脚外部中断 0000 0100
  //对SW2的中断使能 0010 0000
  IEN1 |= 0x20; //是P0端口组
  P0IEN |= 0x02;  //0000 0010
  if(sta){//下降沿触发
    PICTL |= 0x02;   //配置P1_0到P1_3上升沿触发 0010
    PICTL |= 0X01; //设置上升沿触发
  }else{//上升沿触发
    PICTL &= ~0x02;   //配置P1_0到P1_3上升沿触发 0010
    PICTL &= ~0X01; //设置上升沿触发
  }
  EA = 1;       //打开总中断
}
// ****延时函数
void Delay(unsigned int t)
{
  int i;
  while(t--){
    for(i=0;i<255;i++);
  }
}
void Init_WDT(int sta)
{
  if(sta){
    WDCTL |= 0x0c;  //0000 1100
    IEN2 |= 0x20;  //开启看门狗中断
    EA = 1;//开启总中断
  }else{
    WDCTL |= 0x08;  //看门狗模式 时间间隔为1s
  }
}
void Feed_DOG(){
  WDCTL = 0XA0;//1010
  WDCTL = 0X50;//0101
}
void led_check(){
  D5=1;D6=0;D3=0;D4=0;
  Delay(500);
  D5=0;D6=1;D3=0;D4=0;
  Delay(500);
  D5=0;D6=0;D3=1;D4=0;
  Delay(500);
  D5=0;D6=0;D3=0;D4=1;
  Delay(500);
  D5=0;D6=0;D3=0;D4=0;
}
void Init_32MClock(){
  //初始化时钟函数
  CLKCONCMD &=~0x40;//0100 0000系统时钟设置为32M
  while(CLKCONSTA&0x40); //等待时钟切换
  CLKCONCMD &=~0x07;    //0000 0111当前时钟速率32M
}
void Init_16MClock(){
  //初始化时钟函数
  CLKCONCMD |= 0x40;
  while(!(CLKCONSTA & 0x40));
  CLKCONCMD |= 0x01;
}

/*======================初始化串口0函数=======================*/
void Init_Uart0()
{
 //1-指定串口的IO位置；
   PERCFG = 0x00;    //0000 0001 UART0,备用位置1
 //2-相应IO配置成片上外设功能；
   P0SEL = 0x0C;   //0000 1100 P0_2,P0_3为片上外设
 //3-选择串口工作方式（异步UART模式，8个数据位、1个停止位、无流控、无校验确立）。
   U0CSR |=0xc0;  //1100 0000 设置为UART模式，接收使能
   U0UCR |=0x80;  //1000 0000  当前为空闲状态
 //4-波特率；
   U0GCR =8;
   U0BAUD =59;
 //5-清除发送、接收标志位
   UTX0IF =0;
   URX0IF =0;
//6-开CPU中断、对应串口接收中断；
   URX0IE =1;//接收中断使能
   EA=1;
}
/*=====================定时器1初始化函数======================*/
void Init_Timer1()
{
  T1CC0L = 0xd4;    //16MHz时钟128分频定时100ms 13
  T1CC0H = 0x30;    //设先填低8位，再填高8位
  T1CCTL0 |= 0x04;  //开启通道0的输出比较模式
  // T1IE = 1;         //使能定时器1中断	时钟使能
  // T1OVFIM = 1;      //使能定时器1溢出中断
  // EA = 1;           //使能总中断
  T1CTL = 0x0e;     //分频系数是128,模模式 0000 1110
}

void init_ADC() // adc初始化
{
  //1-P0设为模拟输入
  APCFG |=0x01;  //0000 0001 P0_0模拟输入口，AD转换通道0
}

void init1s_WDT()//看门狗定时器初始化函数
 {
   WDCTL |=0x0c;//0000 1100看门狗定时器功能，时间间隔为1S

   //IEN2 |=0x20;//0010 0000开看门狗中断
   //EA=1;
 }